package ua.nure.veretelnyk.practice1;

/*
     Практическое задание №1
     _______________________

     Задание 3
     -------------------------------------------------------
     Название класса: ua.nure.your_last_name.Practice1.Part3
     -------------------------------------------------------

     Написать класс, который реализует функциональность вывода параметров командной строки в консоль (выводить через пробел).

     Пример:
     -------------------------------------------------------
     Параметры командной строки: a b    c d    34
     Консольный вывод: a b c d 34
     -------------------------------------------------------
*/

public class Part3 {
    public static void main(String[] args) {
        for (String s : args){
            System.out.print(s+" ");
        }
        System.out.println("");
    }
}
