package ua.nure.veretelnyk.practice1;

//http://jtrain.ddns.net:2370/part1.txt
/*
    Практическое задание №1
    _______________________

    Задание 1
    -------------------------------------------------------
    Название класса: ua.nure.your_last_name.Practice1.part1
    -------------------------------------------------------

    Написать класс, который реализует функциональность вывода в консоль строки "Hello, World".
    Написать командный файл (bat файл Windows или shell скрипт Linux), который компилирует и запускает данное приложение из консоли.
    Командный файл сохранить в каталоге src проекта.
*/

public class Part1 {
    public static void main(String[] args) {
        System.out.println("Hello world.");
    }
}
